{
    "_id": {
        "$oid": ""
    },
    "id": "",
    "videoURL": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6315744438112",
    "imageURLs": "https://www.allrecipes.com/thmb/jWaBMuJssDwvRmkrkktuWoEVdKU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/18255-BostonBakedBeans-mfs-2X3-0176-310b59a2789940208c765faf58b3580d.jpg",
    "name": "Boston Baked Beans",
    "date": {
        "$timestamp": {
            "t": "",
            "i": ""
        }
    },
    "briefdescription": "These baked beans are slow-cooked in the oven with bacon, onions, and a sweet, syrupy sauce, resulting in an old-fashioned taste that everyone will enjoy.",
    "totalCarbs": "63 g",
    "fat": "6 g",
    "protein": "21 g",
    "calories": "382 kcal",
    "shoppingList": {
        "equipment": [],
        "ingredients": [
            "2 cups dry navy beans, soaked overnight",
            "0.5 pound uncooked bacon strips",
            "1 medium onion, diced",
            "0.5 cup ketchup",
            "3 tablespoons molasses",
            "0.25 cup brown sugar",
            "1 tablespoon Worcestershire sauce",
            "2 teaspoons salt",
            "0.25 teaspoon ground black pepper",
            "0.25 teaspoon dry mustard"
        ]
    },
    "durationToCook": "PT260M",
    "instructions": "Transfer soaked navy beans and soaking water to a saucepan; bring to a boil. Reduce heat and simmer until tender, approximately 1 to 2 hours. Drain and reserve the cooking liquid.\nPreheat the oven to 325 degrees F (165 degrees C).\nArrange 1/2 of the beans in the bottom of a 2-quart casserole dish. Place 1/2 of the bacon strips over the beans and sprinkle 1/2 of the onions over top. Repeat layers once more.\nCombine ketchup, molasses, brown sugar, Worcestershire sauce, salt, pepper, and dry mustard in a large saucepan over medium heat; bring to a boil.\nPour sauce over the beans. Pour in just enough reserved cooking liquid to cover the beans. Cover the casserole dish with a lid or aluminum foil.\nBake in the preheated oven for 1 1/2 hours. Remove the lid and continue to cook, checking every 1/2 hour or so and adding more cooking liquid if necessary to prevent the beans from getting too dry, until beans are tender, 1 1/2 to 2 1/2 more hours.\n",
    "comments": [
        {
            "posterName": "Allrecipes Member",
            "comment": "I loved them. They were so juicy and delicious and went perfect with my 5 hot dogs that i have for lunch every second tuesday (in the other tuesdays i have 10 hot dog). Perfect, i wish i could go to a red sox game and enjoy one of these delicious bean dogs.",
            "rating": "5"
        }
    ],
    "tags": []
}